# Задача 1. ИПшник
## Описание
Нужно написать программу-помощника индивидуальному предпринимателю (далее - ИП), которая помогает ему выбрать лучшую систему налогооблажения. ИП будет заносить суммы доходов и расходов, а программа будет выбирать для него лучшую систему налогообложения из двух:

- УСН доходы - налог 6% от доходов;
- УСН доходы минус расходы - налог 15% от разницы доходов и расходов.
## Функционал программы
1. Ввод сумм доходов и расходов ИП;
2. ИП может несколько раз вносить доходы и расходы, они должны суммироваться с введёнными ранее данными;
3. При выборе ИП опции определения наиболее выгодной системы налогообложения, программа должна вывести название такой системы (УСН доходы или УСН доходы минус расходы);
4. При выводе самой выгодной системы налогооблажения, программа должна вывести также сумму, которую удастся сэкономить, если выбрать эту систему;
5. Программа должна завершаться при вводе слова end;
6. Hалог не может быть отрицательным;
7. Программа должна быть структурирована в методы (например, расчёт налога для одной системы налогооблажения должен представлять собой отдельный статический метод)
___Пример___
~~~
Выберите операцию и введите её номер:
1. Добавить новый доход
2. Добавить новый расход
3. Выбрать ситему налогооблажения
1 <Enter>
Введите сумму дохода:
400 <Enter>

Выберите операцию и введите её номер:
1. Добавить новый доход
2. Добавить новый расход
3. Выбрать ситему налогооблажения
2 <Enter>
Введите сумму расхода:
100 <Enter>

Выберите операцию и введите её номер:
1. Добавить новый доход
2. Добавить новый расход
3. Выбрать ситему налогооблажения
1 <Enter>
Введите сумму дохода:
600 <Enter>

Выберите операцию и введите её номер:
1. Добавить новый доход
2. Добавить новый расход
3. Выбрать ситему налогооблажения
3 <Enter>

Мы советуем вам УСН доходы
Ваш налог составит: 60 рублей
Налог на другой системе: 135 рублей
Экономия: 75 рублей

Выберите операцию и введите её номер:
1. Добавить новый доход
2. Добавить новый расход
3. Выбрать ситему налогооблажения
end <Enter>

Программа завершена!
~~~~
Такой вывод программы основан на следующих расчётах:

Доходы ИП: 400 + 600 = 1000 рублей
Расходы ИП: 100 рублей
УСН доходы: 6% от 1000 рублей = 60 рублей
УСН доходы минус расходы: 15% от 1000-100 рублей = 135 рублей
Экономия: 135 - 60 = 75 рублей
### Процесс реализации
1. Я импортировал класс `Scanner` и создал объект типа `scanner`;
~~~
import java.util.Scanner;
public class Main{
  public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
    }    
}
~~~
2. Далее я создал две пременные в которые сохраняется конечное значения.
~~~
 int earnings = 0;    // доходы
 int spendings = 0;   // расходы
~~~
3. Завел бесконечный цикл.
~~~
 while (true) {
            System.out.println("Выберите операцию и введите её номер:");
            System.out.println("1. Добавить новый доход");
            System.out.println("2 Добавить новый расход");
            System.out.println("3. Выбрать ситему налогооблажения");

            String input = scanner.nextLine();
~~~
в котором постоянно спрашивал бы пользователя ввести одну из предоставленных команд

4. Также добавил условие выхода из цикла. Если пользователь ввел end вместо кода символа и нажал <Enter>, то цикл завершается и выводит отчет где происходит сравнение систем налого облажения .
~~~
 (input.equals("end")) {
                System.out.println("ОТЧЕТ");
                System.out.println("ваш доход составил: " + earnings);
                System.out.println("ваш расход составил: " + spendings);
                System.out.println("налог по первой системе составил: " + taxEarnings(earnings));
                int tax6 = taxEarnings(earnings);
                System.out.println("налог по второй системе: " + taxEarningsMinusSpendings(earnings, spendings));
                int tax15 = taxEarningsMinusSpendings(earnings, spendings);
                int income1 = earnings - spendings - tax6;
                int income2 = earnings - tax15 - spendings;
                if(income1 > income2){
                    System.out.println("выгодная система обложения №1 " + "(" +income1 + ")");
                }else {
                    System.out.println("выгодная систем обложения №2 " + "(" + income2 + ")");
                }
                break;
~~~
программа завершается.
5. Если пользователь ввел какую либо из передоставленных команд, то для этого я написал цикл swich при помощи которо происходит реализация предоставленных команд
~~~
else {
                int operation = Integer.parseInt(input);
                switch (operation) {
                    case 1:// здесь считается доход и сохраняетв переменную earnings
                        System.out.println("Введите сумму дохода:");
                        String moneyStr = scanner.nextLine();
                        int money = Integer.parseInt(moneyStr);
                        earnings += money;
                        System.out.println("ваш доход " + earnings);
                        break;
                    case 2://здесь считается расход и сохраняется в переменную spendings
                        System.out.println("введите сумму расходов:");
                        String moneySpn = scanner.nextLine();
                        int spend = Integer.parseInt(moneySpn);
                        spendings += spend;
                        System.out.println("ваш расход состовлят: " + spendings);
                        break;
                    case 3://здесь происходит выбор системы налогооблажения
                        System.out.println("Выберите операцию и введите её номер:");
                        System.out.println("1 налог 6% от дохода");
                        System.out.println("2 налог 15% от доходов и расходов");
                        String operation2 = scanner.nextLine();
                        int operationTax = Integer.parseInt(operation2);
                        if (operationTax == 1) {
                            int tax6 = taxEarnings(earnings);
                            System.out.println(tax6);
                        } else if (operationTax == 2) {
                            int tax15 = taxEarningsMinusSpendings(earnings, spendings);
                            System.out.println(tax15);
                        } else {
                            System.out.println("нет такой команды");
                        }
                        break;
                    default:
                        System.out.println("нет такой команды");
~~~                        
6. Так же я создал два метода подсчета налогов
- для системы УСН доходы - налог 6% от доходов
~~~
  public static int taxEarnings (int spendings){
            int tax = spendings * 6 / 100;
            if (tax >= 0) {
                return tax;
            }else {
                return 0;
            }
        }
~~~
- для системы - УСН доходы минус расходы - налог 15% от разницы доходов и расходов.
~~~
     public static int taxEarningsMinusSpendings(int earnings, int spendings) {
            int tax = (earnings - spendings) * 15 / 100;
            if (tax >= 0) {
                return tax;
            } else {
                return 0;
            }
        }
